IDEA Open Model
MatPrestressSteelSIA Properties
Compatible with IDEA StatiCa Beta 20.0
The MatPrestressSteelSIA type exposes the following members.
Properties
Name | Description
Area
 Area
 (Inherited from MatPrestressSteel.)
DiagramType
 Type of diagram
Diameter
 Diameter
 (Inherited from MatPrestressSteel.)
E
 Young's modulus
 (Inherited from Material.)
Epsud
 dimensioning value of ultimate strain of reinforcing steel or prestressing steel
Epsuk
 characteristic value of ultimate strain of reinforcing steel or strain at maximum load for prestressing steel
EquivalentDiameter
 Equivalent diameter
 (Inherited from MatPrestressSteel.)
Fp01k
 characteristic value of yield strength of prestressing steel
Fpd
 dimensioning value of yield strength of prestressing steel
Fpk
 characteristic value of tensile strength of prestressing steel
G
 Shear modulus
 (Inherited from Material.)
Id
 Element Id
 (Inherited from OpenElementId.)
IsDefaultMaterial
 True if material is default material from the code
 (Inherited from Material.)
LoadFromLibrary
 Load from library - try override properties from library find material by name
 (Inherited from Material.)
Name
 Name of material
 (Inherited from Material.)
NumberOfWires
 number of wires in strand
 (Inherited from MatPrestressSteel.)
OrderInCode
 Order of this material in the code
 (Inherited from Material.)
Poisson
 Poisson's ratio
 (Inherited from Material.)
SpecificHeat
 Specific heat capacity
 (Inherited from Material.)
StateOfThermalConductivity
 State of thermal conductivity curvature
 (Inherited from Material.)
StateOfThermalExpansion
 State of thermal expansion curvature
 (Inherited from Material.)
StateOfThermalSpecificHeat
 State of thermal specific heat curvature
 (Inherited from Material.)
StateOfThermalStrain
 State of thermal strain curvature
 (Inherited from Material.)
StateOfThermalStressStrain
 State of thermal specific stress-strain curvature
 (Inherited from Material.)
SurfaceCharacteristic
 Surface characteristic
ThermalConductivity
 Thermal conductivity
 (Inherited from Material.)
ThermalExpansion
 Thermal expansion
 (Inherited from Material.)
Type
 Type of prestress steel
UnitMass
 Unit weight
 (Inherited from Material.)
UserThermalConductivityCurvature
 User-defined curvature for thermal conductivity curvature { x = Θ[K], y = λc[W/(m K)] }
 (Inherited from Material.)
UserThermalExpansionCurvature
 User-defined curvature for thermal expansion curvature { x = Θ[K], y = γ[K-1] }
 (Inherited from Material.)
UserThermalSpecificHeatCurvature
 User-defined curvature for thermal specific heat { x = Θ[K], y = cp[J/(kg K)] }
 (Inherited from Material.)
UserThermalStrainCurvature
 User-defined curvature for thermal strain curvature { x = Θ[K], y = εc[Δl/l] }
 (Inherited from Material.)
UserThermalStressStrainCurvature
 User-defined curvature for thermal stress,strain { Temperature = Θ[K], {x = ε[-], y = σ[Pa]}}
 (Inherited from Material.)
Top
See Also
Reference
MatPrestressSteelSIA Class
IdeaRS.OpenModel.Material Namespace